In [39]:
import pandas as pd

In [65]:
pd.read_excel(r"C:\Users\satyam\Desktop\data.xlsx")

       name  class  roll no
0  abhishek      1       77
1       ram      2       88
2      ravi      3       66

In [69]:
pd.read_csv(r"C:\Users\satyam\Desktop\data2.csv")

       name  class roll no
0  abhishek      1      77
1       ram      2      88
2      ravi      3      66
3       vhj      4     77k
4       huh      5      78

In [75]:
pd.read_csv(r"C:\Users\satyam\Desktop\data 4.txt",sep='\t')

    name class rollno adress
0   subham 6   67     hjkjkj
1  raj    7   76     hhjhjh
2   nihal  9   65      hhghg